example = 'Рабиндранат Тагор'

# Вывод на экран(в консоль) первого символа строки.

print(example[0])

# Вывод на экран(в консоль) последнего символа строки (используется отрицательный индекс).

print(example[-1])

# Вывод на экран(в консоль) второй половины строки (С нечётным количеством символов).

print(example[(len(example)//2):])

print(len(example))
# Вывод на экран(в консоль) слова наоборот.

print(example[::-1])

# Вывод на экран(в консоль) каждого второго символа строки.

print(example[1::2])